Load Tests/ToDo Endpoint/Delete/deleteTest.yaml
config:
  target: 'https://localhost:7204'
  payload:
    path: todos.csv
    fields:
      - "title"      
    skipHeader: true    
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 10
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 5
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75

scenarios:
  - flow:
    - log: "Creates a ToDo"
    - post:
        url: "/api/todos"
        json: {
          title: "To delete ToDo"
        }
        capture:
          - header: location
            as: location
    - log: "Gets a ToDo"
    - get:
        url: "{{ location }}"
        capture:
          - json: $.id
            as: "id"
    - log: "Deletes a ToDo"
    - delete:
        url: /api/todos/{{id}}